/*
SELECT 
	*
FROM 
	Invoice i 
LIMIT 10;


SELECT 
	*
FROM 
	InvoiceLine il 
LIMIT 10;


SELECT 
	*
FROM 
	Track t 
LIMIT 10;

*/

/* 1#
 Порівняти всіх музичних виконавчів за кількістю проданих музичних треків та загальною сумою продажу
*/


SELECT 
	a.Name ,
	SUM(il.Quantity) AS sold_quantity,
	SUM(il.UnitPrice * il.Quantity) AS sold_in_usd
FROM 
	Artist a 
JOIN
	Album a2 ON
	a.ArtistId = a2.ArtistId
JOIN 
	Track t ON
	a2.AlbumId = t.AlbumId 
JOIN 
	InvoiceLine il ON
	t.TrackId = il.TrackId 
GROUP BY 
	a.Name 
ORDER BY 
	sold_quantity DESC, sold_in_usd DESC  
LIMIT 10;


/* 2#
Сформувати топ-3 співробітника за рівнем продажів для кожного року
*/


/* 3#
Сформувати топ-3 співробітника за рівнем продажів для кожного року
*/


/* 4#
Надати інформацію про клієнтів, які придбали музичні треки в межах 4 різних жанрів
*/


/* 5#
Сформувати перелік клієнтів, які станом на останній місяць продажів не придбали нічого протягом 1 місяця, 2 місяців, 3 місяців
*/


/* 6#
Сформувати найбільш популярний жанр з числа перших покуплк клієнтів
*/


/* 7#
Сформувати найбільш популярний жанр з числа перших покупок клієнтів
*/


/* 8#
Вивести динаміку продажів музичних треків за останні 3 роки
*/


/* 9#
Дослідити кумулятивну суму продажів для кожного замовника
*/


/* 10#
Розрахувати середній чек
*/


/* 11#
Розрахувати середню загальну суму продажу в перерахунку на одного замовника
*/


/* 12#
Розрахувати середню загальну суму продажу в перерахунку на одного замовника
*/


/* 13#
Розрахувати середню тривалість періоду між першою покупкою і другою
*/
